Sanjay-MicrovisionEmbedded/MV-BLE-Mesh/MGM21_vcs/MGM21_vcs/autogen/sl_cli_command_table.c
/***************************************************************************//**
 * @file sl_cli_command_table.c
 * @brief Declarations of relevant command structs for cli framework.
 * @version x.y.z
 *******************************************************************************
 * # License
 * <b>Copyright 2018 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#include <stdlib.h>

#include "sl_cli_config.h"
#include "sl_cli_command.h"
#include "sl_cli_arguments.h"

#ifdef __cplusplus
extern "C" {
#endif

/*******************************************************************************
 *****************************   TEMPLATED FILE   ******************************
 ******************************************************************************/

/*******************************************************************************
 * Example syntax (.slcc or .slcp) for populating this file:
 *
 *   template_contribution:
 *     - name: cli_command          # Register a command
 *       value:
 *         name: status             # Name of command
 *         handler: status_command  # Function to be called. Must be defined
 *         help: "Prints status"    # Optional help description
 *         shortcuts:               # Optional shorcut list
 *           - name: st
 *         argument:                # Argument list, if apliccable
 *           - type: uint8          # Variable type
 *             help: "Channel"      # Optional description
 *           - type: string
 *             help: "Text"
 *     - name: cli_group            # Register a group
 *       value:
 *         name: shell              # Group name
 *         help: "Shell commands"   # Optional help description
 *         shortcuts:               # Optional shorcuts
 *           - name: sh
 *     - name: cli_command
 *       value:
 *         name: repeat
 *         handler: repeat_cmd
 *         help: "Repeat commands"
 *         shortcuts:
 *           - name: r
 *           - name: rep
 *         group: shell            # Associate command with group
 *         argument:
 *           - type: string
 *             help: "Text"
 *           - type: additional
 *             help: "More text"
 *
 ******************************************************************************/

// Provide function declarations
void factory_reset_from_cli(sl_cli_command_arg_t *arguments);
void node_reset_from_cli(sl_cli_command_arg_t *arguments);

// Command structs. Names are in the format : cli_cmd_{command group name}_{command name}
// In order to support hyphen in command and group name, every occurence of it while
// building struct names will be replaced by "_hyphen_"
static const sl_cli_command_info_t cli_cmd_factory_full_reset = \
  SL_CLI_COMMAND(factory_reset_from_cli,
                 "Triggers a factory reset that erase all NVM keys",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_factory_node_reset = \
  SL_CLI_COMMAND(node_reset_from_cli,
                 "Triggers a node reset that erase all mesh stack data",
                  "",
                 {SL_CLI_ARG_END, });


// Create group command tables and structs if cli_groups given
// in template. Group name is suffixed with _group_table for tables
// and group commands are cli_cmd_( group name )_group
static const sl_cli_command_entry_t factory_group_table[] = {
  { "full_reset", &cli_cmd_factory_full_reset, false },
  { "r", &cli_cmd_factory_full_reset, true },
  { "node_reset", &cli_cmd_factory_node_reset, false },
  { "n", &cli_cmd_factory_node_reset, true },
  { NULL, NULL, false },
};
static const sl_cli_command_info_t cli_cmd_factory_group = \
  SL_CLI_COMMAND_GROUP(factory_group_table, "Factory functions (e.g. factory reset).");

// Create root command table
const sl_cli_command_entry_t sl_cli_default_command_table[] = {
  { "factory", &cli_cmd_factory_group, false },
  { "f", &cli_cmd_factory_group, true },
  { NULL, NULL, false },
};


#ifdef __cplusplus
}
#endif
